app/Controllers/Auth.php

            ];

            $userModel = new \App\Models\UserModel();
            $query = $userModel->insert($values);
---
INSERT INTO `user` (`username`, `email`, `password`) VALUES ('Test', 'ABC@gmail.com', '$2y$10$ItqQbZfB4MTmZ.hlWYGcL./moWMm1efmSjncQwh0MgHar5QuAtGB2')

    public function login()
    {
        $validation = $this->validate([
            'email'=>[
                'rules' => 'required|valid_email|is_not_unique[user.email]',
                'errors' => [
                    'required' => 'Your Email is Required',
                    'valid_email' => 'Enter a Valid Email Address',
                    'is_not_unique' =>'This email is not registered',
                ]
            ],

            'password' => [
                'rules' => 'required|min_length[5]|max_length[12]',
                'errors' => [
                    'required' => 'Password is Required',
                    'min_length' => 'Password must be at least 5 characters in length',
                    'max_length' => 'Password must not have characters more than 12 in length',
                ]
            ],
        ]);

        if(!$validation){
            return view('auth/login', ['validation'=>$this->validator]);
        }else{
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $userModel = new \App\Models\UserModel();
            $user_info = $userModel->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'ABC@gmail.com'
 LIMIT 1