app/Controllers/Dashboard.php

    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '17'

    function profile()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '17'